admin/org_roam/20240904155624-emp3001assessment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-09-04 Wed 16:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>EMP3001Assessment</title>
<meta name="author" content="Paul Hewson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">EMP3001Assessment</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgb3a383b">1. Commercial and Industrial Experience in Mathematics and Computer Science: EPM3001 2024/25</a>
<ul>
<li><a href="#org0e1c391">1.1. Technical Report. 70% of module mark.</a></li>
<li><a href="#orgc5d0d49">1.2. Poster. 30% of module mark.</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3a383b" class="outline-2">
<h2 id="orgb3a383b"><span class="section-number-2">1.</span> Commercial and Industrial Experience in Mathematics and Computer Science: EPM3001 2024/25</h2>
<div class="outline-text-2" id="text-1">
<p>
(for placements summer 2024)
</p>

<p>
Module summary and marking guidelines
</p>

<p>
Module leader: Prof Mark Baldwin
</p>

<p>
Updated 6 August 2024
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summative Assessment</th>
<th scope="col" class="org-right">Weight</th>
<th scope="col" class="org-right">Due date</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Technical Report</td>
<td class="org-right">70%</td>
<td class="org-right">13.9.2024</td>
</tr>

<tr>
<td class="org-left">Poster</td>
<td class="org-right">30%</td>
<td class="org-right">20.9.2024</td>
</tr>
</tbody>
</table>


<p>
Summer student placements end before term starts 23 September 2024. Accordingly, the main assignment is due 13 September 2024. This gives you the maximum time to work on your submissions. This date allows for students to request extensions (up to two weeks) to the due date. The date for poster submission is 20 September 2024, and the poster session will be
timetabled for the first half of October.
</p>

<p>
Note: The ELE page has links to recorded lectures on: how to do a presentation, how to make figures, how to write a report, how to format a report, how to cite literature, etc. Live lectures are not possible since you will be on placements. The ELE page also has the Employer’s form in both PDF and Word formats.
</p>
</div>

<div id="outline-container-org0e1c391" class="outline-3">
<h3 id="org0e1c391"><span class="section-number-3">1.1.</span> Technical Report. 70% of module mark.</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This report should not exceed 4000 words of text. You are required to write a report describing
a specific project(s) or substantial piece of work that you undertook during your work
placement. The 4000 words does not include references, figures, captions, etc. The report
should include some references, using the academic style of your choice. These could be
technical references, or resources you used to handle issues in your placement (e.g., a book on
how to deal with office politics, or an article about discrimination in the workplace).
The report must include the following three sections, with the following titles – so do not do
something different! Subsections are OK. You may include a brief summary (not marked) of the
report, and include news such as being offered a job at your placement.
</p>

<ol class="org-ol">
<li><p>
Introduction (20 marks)
</p>
<ul class="org-ul">
<li>The overall aim of the placement, including a description of the company’s structure and operations and an explanation of how the placement opportunity and work undertaken develops and extends your particular interests, skills and supports your career intentions.</li>
</ul>
<p>
• Specification of the particular task(s) you were charged with on the placement, including a clear description of a ‘problem(s)’ or challenge(s) you tackled.
</p></li>
<li>Technical Challenges (30 marks)
• A clear outline of the strategy you employed to address the problem or challenge revealing how you have applied problem-solving skills and knowledge from your discipline area (link to the specific technical contents from specific modules you would have taken including module code). These are technical challenges and you must show how you applied discipline knowledge and expertise to solve them.
• An evaluation of your strategy which should determine and reveal your effectiveness in resolving the problem or challenge and makes recommendations for future enhancements. You should critically assess the professional technical skills you gained/developed during your internship.</li>
<li>Interpersonal skills and workplace challenges (30 marks)
• This section will enable you to identify and reflect on interpersonal workplace challenges and particular events which you consider to be noteworthy whilst undertaking your placement. For example, a difficult boss, unrealistic expectations, co- workers plotting against you, sexism/racism/cultural challeges.
• These are not technical problems, but rather “soft” challenges that arise from office/workplace interaction, conflict, work deadlines, etc.
• The idea behind selecting and reflecting on these particular events is that you should be able to consider them in the light of the discipline-related and personal skills which you will have brought to the placement and also how they have helped develop these and new skills in the workplace setting. Your jounal should help you to identify the critical incidents you want to write about.
• Reflection should be a critical process and you should be able to articulate your thoughts, ideas and perspectives to convey the process of learning which occurred during the placement. Write about what you were thinking at the time.</li>
<li>In addition, your report should look professional (20 Marks)
• An appropriate professional presentation, layout, style, and readability – failure to keep within the maximum word count (4000 words will be penalised by 5 marks.
• Make sure you pay attention to the typography and data graphics videos.</li>
</ol>

<p>
Also, you may add a short Summary or Conclusions section, but it is not marked.
</p>

<p>
Hand in time and date for technical report – Student Services Office (E-BART) by 12.00 hours on Friday 13 September 2024
</p>
</div>
</div>

<div id="outline-container-orgc5d0d49" class="outline-3">
<h3 id="orgc5d0d49"><span class="section-number-3">1.2.</span> Poster. 30% of module mark.</h3>
<div class="outline-text-3" id="text-1-2">
<p>
The poster session will take place during the first half of October after your placements are
complete.
</p>

<p>
There is no template for the poster—it is up to you to choose everything about the poster. The
posters have been printed in past years at the A1 size, but since the aspect ratio for all A paper
sizes is the same, it really does not matter. You will upload a PDF of your poster to BART, and all
the posters will be printed for you, and then hung for you on the day of the poster session.
Poster marking. The poster session is designed for you explain to an interested person what you
did, where, why, how the placement was related to your degree. Your poster will be printed
and displayed for you. There is no required template for the poster. Be sure to have your name
printed prominently at the top of the poster, so the markers can find you.
Hand in time and date for poster – Student Services Office (E-BART) by 12:00 Friday 20
September 2024.
Markers will use the following score sheet:
</p>

<p>
Student:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Feedback</th>
<th scope="col" class="org-left">Mark</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Visual impact</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/5</td>
</tr>

<tr>
<td class="org-left"><i>Professional look,</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>layout, visual aids etc.</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Content</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/10</td>
</tr>

<tr>
<td class="org-left"><i>Contains all necessary</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>information. Well</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>organised. Clear and</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>legible. Easy to follow</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>for non-specialists</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left"><b>Interview</b></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">/5</td>
</tr>

<tr>
<td class="org-left"><i>Knowledge of project and</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>work undertaken. Ability</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>to convey  your placement</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left"><i>experience to an audience</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Total</td>
<td class="org-left">/20</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul Hewson</p>
<p class="date">Created: 2024-09-04 Wed 16:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
